 import React from "react";
 import { useState,useEffect } from "react";
 import "./navbar.css";
 import { FaTimes } from "react-icons/fa";
 const Navbar=function(){
    const[quranic_verse,setquranicverse]=useState(false);
    const [quranic_doaa,setquranic_doaa]=useState([
  {
    "content": "اهدِنَا الصِّرَاطَ الْمُسْتَقِيمَ ٦ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ ٧",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا تَقَبَّلْ مِنَّا ۖ إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ ١٢٧",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَا أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا ۖ إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ ١٢٨",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ ٢٠١",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ ٢٥٠",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ ٢٨٥",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ ٢٨٦",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً ۚ إِنَّكَ أَنتَ الْوَهَّابُ ٨",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ ١٦",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبِّ هَبْ لِي مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ الدُّعَاءِ ٣٨",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا اغْفِرْ لَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ ١٤٧",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا مَا خَلَقْتَ هَٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ ١٩١",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ ١٩٣",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ ۗ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ ١٩٤",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا أَخْرِجْنَا مِنْ هَٰذِهِ الْقَرْيَةِ الظَّالِمِ أَهْلُهَا وَاجْعَل لَّنَا مِن لَّدُنكَ وَلِيًّا وَاجْعَل لَّنَا مِن لَّدُنكَ نَصِيرًا ٧٥",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ ٢٣",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ ٤٧",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "وَسِعَ رَبُّنَا كُلَّ شَيْءٍ عِلْمًا ۚ عَلَى اللَّهِ تَوَكَّلْنَا ۚ رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ ٨٩",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ ١٢٦",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَّبِّ لَوْ شِئْتَ أَهْلَكْتَهُم مِّن قَبْلُ وَإِيَّايَ ۖ أَتُهْلِكُنَا بِمَا فَعَلَ السُّفَهَاءُ مِنَّا ۖ إِنْ هِيَ إِلَّا فِتْنَتُكَ تُضِلُّ بِهَا مَن تَشَاءُ وَتَهْدِي مَن تَشَاءُ ۖ أَنتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا ۖ وَأَنتَ خَيْرُ الْغَافِرِينَ ١٥٥",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "عَلَى اللَّهِ تَوَكَّلْنَا رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ ٨٥ وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ ٨٦",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ ۖ وَإِلَّا تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ ٤٧",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
   {
    "content": "فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ ١٠١",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا إِنَّكَ تَعْلَمُ مَا نُخْفِي وَمَا نُعْلِنُ ۗ وَمَا يَخْفَىٰ عَلَى اللَّهِ مِن شَيْءٍ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ ٣٨",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ ٤٠",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ ٤١",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَّبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا ٢٤",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَّبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَل لِّي مِن لَّدُنكَ سُلْطَانًا نَّصِيرًا ٨٠",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا ١٠",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبِّ إِنِّي وَهَنَ الْعَظْمُ مِنِّي وَاشْتَعَلَ الرَّأْسُ شَيْبًا وَلَمْ أَكُن بِدُعَائِكَ رَبِّ شَقِيًّا ٤",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "هَبْ لِي مِن لَّدُنكَ وَلِيًّا ٥",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبِّ اشْرَحْ لِي صَدْرِي ٢٥ وَيَسِّرْ لِي أَمْرِي ٢٦ وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي ٢٧ يَفْقَهُوا قَوْلِي ٢٨",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَّبِّ زِدْنِي عِلْمًا ١١٤",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ ٨٣",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "لَّا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ ٨٧",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ ٨٩",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَّبِّ أَنزِلْنِي مُنزَلًا مُّبَارَكًا وَأَنتَ خَيْرُ الْمُنزِلِينَ ٢٩",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينَِ ٩٧ وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ ٩٨",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ ١٠٩",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ ١١٨",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا ٧٤",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ ٨٣ وَاجْعَل لِّي لِسَانَ صِدْقٍ فِي الْآخِرِينَ ٨٤ وَاجْعَلْنِي مِن وَرَثَةِ جَنَّةِ النَّعِيمِ ٨٥ وَاغْفِرْ لِأَبِي إِنَّهُ كَانَ مِنَ الضَّالِّينَ ٨٦ وَلَا تُخْزِنِي يَوْمَ يُبْعَثُونَ ٨٧ يَوْمَ لَا يَنفَعُ مَالٌ وَلَا بَنُونَ ٨٨ إِلَّا مَنْ أَتَى اللَّهَ بِقَلْبٍ سَلِيمٍ ٨٩",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبِّ نَجِّنِي وَأَهْلِي مِمَّا يَعْمَلُونَ ١٦٩",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ ١٩",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي ١٦",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبِّ انصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ ٣٠",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَّحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَابَ الْجَحِيمِ ٧",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدتَّهُمْ وَمَن صَلَحَ مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ ۚ إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ ٨ وَقِهِمُ السَّيِّئَاتِ ۚ وَمَن تَقِ السَّيِّئَاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ ۚ وَذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ ٩",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا اكْشِفْ عَنَّا الْعَذَابَ إِنَّا مُؤْمِنُونَ ١٢",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي ۖ إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ ١٥",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَّحِيمٌ ١٠",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا ۖ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ ٨",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَبِّ ابْنِ لِي عِندَكَ بَيْتًا فِي الْجَنَّةِ ١١",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },{
    "content": "نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَِ ١١",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَّبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا ٢٦ إِنَّكَ إِن تَذَرْهُمْ يُضِلُّوا عِبَادَكَ وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا ٢٧",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "رَّبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا ٢٨",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ١ مِن شَرِّ مَا خَلَقَ ٢ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ٣ وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ٤ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ٥",
    "counter": 1,
    "count": 0,
    "type": "verse"
  },
  {
    "content": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ ١ مَلِكِ النَّاسِ ٢ إِلَٰهِ النَّاسِ ٣ مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ٤ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ٥ مِنَ الْجِنَّةِ وَالنَّاسِ ٦",
    "counter": 1,
    "count": 0,
    "type": "verse"
  }
]
);
    const [azkar_content_index,setazkar_content_index]=useState(0);
    const [azkar,setazkar]=useState([[{content:"اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ ٢٥٥",counter:1,count:0 ,type:"verse"},{content:"قُلْ هُوَ ٱللَّهُ أَحَدٌ ١ ٱللَّهُ ٱلصَّمَدُ ٢ لَمْ يَلِدْ وَلَمْ يُولَدْ ٣ وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ ٤",counter:3,count:0,type:"verse"},{content:"قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ ١ مِن شَرِّ مَا خَلَقَ ٢ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ٣ وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ ٤ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ٥",counter:3,count:0,type:"verse"},{content:"قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ ١ مَلِكِ ٱلنَّاسِ ٢ إِلَٰهِ ٱلنَّاسِ ٣ مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ ٤ ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ ٥ مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ ٦",counter:3,count:0,type:"verse"},{content:"أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.",counter:1,count:0,type:"doaa"},{content:"اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .",counter:1,count:0,type:"doaa"},{
    content: "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.",
    type: "doaa",
    counter: 3,
    count: 0
  }, {
    content: "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك، وَمَلَائِكَتَكَ، وَجَمـيعَ خَلْـقِك، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك، وَأَنَّ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
    type: "doaa",
    counter: 4,
    count: 0
  },
  {
    content: "اللّهُـمَّ ما أَصْبَـحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
    type: "doaa",
    counter: 1,
    count: 0
  },
  {
    content: "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.",
    type: "zekr",
    counter: 7,
    count: 0
  },
  {
    content: "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
    type: "zekr",
    counter: 3,
    count: 0
  },
  {
    content: "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.",
    type: "doaa",
    counter: 1,
    count: 0
  },
  {
    content: "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
    type: "zekr",
    counter: 1,
    count: 0
  },
  {
    content: "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه، وَرِضـا نَفْسِـه، وَزِنَـةَ عَـرْشِـه، وَمِـدادَ كَلِمـاتِـه.",
    type: "zekr",
    counter: 3,
    count: 0
  },
  {
    content: "اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري، لا إلهَ إلاّ أَنْـتَ. اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر، وَالفَـقْر، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر، لا إلهَ إلاّ أَنْـتَ.",
    type: "doaa",
    counter: 3,
    count: 0
  },
  {
    content: "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ، أصْلِحْ لِي شَأنِي كُلَّهُ، وَلا تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.",
    type: "doaa",
    counter: 3,
    count: 0
  },
  {
    content: "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.",
    type: "zekr",
    counter: 100,
    count: 0
  },
  {
    content: "سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
    type: "zekr",
    counter: 100,
    count: 0
  },
  {
    content: "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ.",
    type: "zekr",
    counter: 100,
    count: 0
  },
  {
    content: "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبَيِّنَا مُحَمَّدٍ.",
    type: "zekr",
    counter: 10,
    count: 0
  }],[
  {
    content: "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ ٢٥٥",
    type: "verse",
    counter: 1,
    count: 0
  },
  {
    content: "آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ ٢٨٥ لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ ٢٨٦",
    type: "verse",
    counter: 1,
    count: 0
  },
  {
    content: "قُلْ هُوَ ٱللَّهُ أَحَدٌ ١ ٱللَّهُ ٱلصَّمَدُ ٢ لَمْ يَلِدْ وَلَمْ يُولَدْ ٣ وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ ٤",
    type: "verse",
    counter: 3,
    count: 0
  },
  {
    content: "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ ١ مِن شَرِّ مَا خَلَقَ ٢ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ٣ وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ ٤ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ٥",
    type: "verse",
    counter: 3,
    count: 0
  },
  {
    content: "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ ١ مَلِكِ ٱلنَّاسِ ٢ إِلَٰهِ ٱلنَّاسِ ٣ مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ ٤ ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ ٥ مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ ٦",
    type: "verse",
    counter: 3,
    count: 0
  },
  {
    content: "أَمْسَيْـنا وَأَمْسـى المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ...",
    type: "zekr",
    counter: 1,
    count: 0
  },
  {
    content: "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك...",
    type: "doaa",
    counter: 1,
    count: 0
  },
  {
    content: "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.",
    type: "zekr",
    counter: 3,
    count: 0
  },
  {
    content: "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك...",
    type: "doaa",
    counter: 4,
    count: 0
  },
  {
    content: "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك...",
    type: "doaa",
    counter: 1,
    count: 0
  },
  {
    content: "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ...",
    type: "zekr",
    counter: 7,
    count: 0
  },
  {
    content: "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ...",
    type: "zekr",
    counter: 3,
    count: 0
  },
  {
    content: "سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
    type: "zekr",
    counter: 100,
    count: 0
  },
  {
    content: "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيهِ",
    type: "zekr",
    counter: 100,
    count: 0
  },
  {
    content: "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبَيِّنَا مُحَمَّدٍ",
    type: "zekr",
    counter: 10,
    count: 0
  }
]]);
    const [alazkar,setalazkar]=useState(false);
    const[is_massa_azkar,setis_massa_azkar]=useState(false);
    const [Remembrance,setRemembrance]=useState(false);
    const [time, setTime] = useState(new Date());
   useEffect(() => {
    const interval = setInterval(() => {
      setTime(new Date());
    }, 1000)},[]);
    function active_azkar(){
        setazkar_content_index(1);
         setis_massa_azkar(true);
    }
    function toggel_quranic_doaa(){
    setquranicverse(!quranic_verse);
    setRemembrance(false);
    setalazkar(false);
    }
    function toggel_azkar(){
        setalazkar(!alazkar);
        setRemembrance(false);
        setquranicverse(false);
    }
    function deactive_azkar(){
        setazkar_content_index(0);
         setis_massa_azkar(false);
    }
    function inc_counter(data){
        if(data.counter<=data.count){
         console.log("the count is larg than counter");
        }
        else if(data.count<data.counter){
        data.count++;
        }
   
    }
  // احصل على الساعة بنظام 12 ساعة
  const hour12 = time.getHours() % 12 || 12; // يحول 0 إلى 12
  const firstDigit = hour12.toString()[0]; 
  const hijri = new Intl.DateTimeFormat("en-US-u-ca-islamic", {
    day: "numeric",
    month: "long",
    year: "numeric",
  }).format(time);
  function mounth_name(number){
    switch (number) {
        case 0:
            return "January"
            break;
        case 1:
            return "February"
        case 2:
            return "March"
             break;
        case 3:
            return "April"
             break;
        case 4:
            return "May"
             break;
        case 5:
            return "June"
             break;
        case 6:
            return "July"
             break;
        case 7:
            return "August"
             break;
        case 8:
            return "September"
             break;
        case 9:
            return "October"
             break;
        case 10:
            return "November"
             break;
        case 11:
            return "December"
             break;
        default:
            break;
    }
  }
  return (<>
   <div className="Navbar">
    <div className="left_side">
        <p className="time">
       {hour12 +":"+time.getMinutes()}  <span className="PM">PM</span> 
        </p>
        <div className="virtical_line">
        </div>
        <div className="Date">
           {/* <p>January 19, 2026</p> */}
           <p>{mounth_name(time.getMonth())} {time.getDate()+","+time.getFullYear()}</p>
           {/* <p>Rajab 30, 1447 AH</p> */}
           <p>{hijri}</p>
        </div>
    </div>
    <div className="right_side">
        <div className="Link">روابط سريعة</div>
         <div className="virtical_line">
        </div>
        <div className="azkar" onClick={()=>setRemembrance(!Remembrance)}>أذكار وأدعية</div>
    </div>
    </div>
    <div className={Remembrance ?"Remembrance":"none"}>
        <ul className="ul1" >
            <li>
            <p onClick={toggel_azkar}>أذكار الصباح والمساء</p>
            </li>
              <li>
            <p onClick={toggel_quranic_doaa}>أدعية قرانية</p>
            </li>
             <li>
            <p>أذكارك الخاصة </p>
            </li>
        </ul>
    </div>
    <div className={alazkar?"Remembrance_content" :"Remembrance_content none"}>
      <div className="Remmebernece_type_nav">
   <FaTimes className="closeicon " onClick={toggel_azkar}/>
     <div className="Remembrance_type  ">
        <div onClick={active_azkar} className={is_massa_azkar?"massa right  active_Remembrance_type":"massa right"}>اذكار المساء</div>
        <div onClick={deactive_azkar} className={!is_massa_azkar?"sabah left active_Remembrance_type":"sabah left"}>أذكار الصباح </div>
       
      </div>
     
     </div> 
     <div className="alAzkar">
        {azkar[azkar_content_index].map((data,index)=>{return(<div key={index} className={data.type==="verse"? "azkar_content quran_font":"azkar_content doa_font"} >{data.content} <button onClick={()=>inc_counter(data)} className="bu2">{data.count+" / "+data.counter}</button></div>)})}
     </div>
    
    </div>
    <div className={quranic_verse? "Remembrance_content":"Remembrance_content none"} >
     <div className="doaa_navbar">أدعية قرآنية
     <FaTimes className="closeicon" onClick={toggel_quranic_doaa} />
</div>
{quranic_doaa.map((data,index)=>{return (<div key={index} className={data.type==="verse"?"alAzkar quran_font azkar_content":"alAzkar azkar_content"}>{data.content}</div>)})}
    </div>
  </>
   
)
 }
 export default Navbar;